// =================================================================
// const cart = [{name: "Үзэг", quantity: 1}, {name: "Дэвтэр", quantity: 2}];
// if (cart[0].quantity > 1) {
//   cart[0].quantity = cart[0].quantity - 1;
// } else if (cart[0].quantity === 1) {
//   cart.splice(0, 1);
// } else {
//   console.log("Хасах бараа алга");
// }
// console.log(cart);
// =================================================================
// const settings = {sound: true, notifications : false};
// const selectedKey = "notifications";
// if (selectedKey in settings) {
//   settings.notifications = !settings.notifications;
// } else {
//   console.log("Тохиргоо олдсонгүй");
// };
// console.log(settings);
// =================================================================
// const profile = {username: "nomi"};
// const takenNames = ["admin", "guest", "bat"];
// const newUsername = "saraa";
// if (newUsername.length < 4) {
//   console.log("Нэр хэт богино");
// } else if (profile.username === newUsername) {
//   console.log("Нэр өөрчлөгдөөгүй");
// } else if (takenNames.includes(newUsername)) {
//   console.log("Энэ нэр ашиглагдаж байна");
// } else {
//   profile.username = newUsername;
// };
// console.log(profile);
// =================================================================
// const file = {name: "lesson.pdf", extension: "pdf", sizeMB: 8};
// const allowedExtensions = ["pdf", "txt"];
// if (!allowedExtensions.includes(file.extension)) {
//   console.log("Файлын төрөл тохирохгүй");
// } else if (allowedExtensions.includes(file.extension) && file.sizeMB > 10) {
//   console.log("Файл хэт том");
// } else {
//   console.log("Файлыг байршуулах боломжтой");
// };
// =================================================================
// const existingMeeting = {start: 10, end: 12};
// const newMeeting = {start: 11, end: 13};
// if (newMeeting.start >= newMeeting.end) {
//   console.log("Цагийн мэдээлэл буруу")
// } else if ((existingMeeting.start > newMeeting.start && existingMeeting.start < newMeeting.end) 
//   || (existingMeeting.end > newMeeting.start && existingMeeting.end < newMeeting.end) 
//   || (existingMeeting.start <= newMeeting.start && existingMeeting.end >= newMeeting.end)) {
//   console.log("Уулзалтын цаг давхцаж байна");
// } else {
//   console.log("done");
// };
// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

// =================================================================

